# This is Fantasy Auction
### Team picked by 10 contestants through auction.
### After auction teams earn points through player performance in IPL.
### After IPL ends winner will be decided
#### I Prepare this auction for 2026

### I run the project for 2025 IPL Season

In [16]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings 
warnings.filterwarnings('ignore')

pd.set_option('display.max_rows',None)
pd.set_option('display.max_columns',None)
pd.set_option('display.expand_frame_repr',False)
pd.set_option('max_colwidth',25)

In [17]:
df = pd.read_csv('ipl_2008_to_2025_ball_by_ball_data.csv')

In [18]:
season = [2025,'2025']

In [19]:
df = df[df['season'].isin(season)]

In [20]:
team_1 = ['PD Salt','KL Rahul','Mohammed Shami','Ravi Bishnoi','AM Rahane','Mukesh Kumar',
             'AJ Hosein','V Suryavanshi','A Mhatre','Shashank Singh','V Nigam','PP Shaw','PHKD Mendis',
             'L Wood','MP Yadav'] # 6 player Remaining 

team_2 = ['SS Iyer','Rashid Khan','H Klaasen','TA Boult','JR Hazlewood','B Sai Sudharsan',
       'Azmatullah Omarzai','SE Rutherford','Dhruv Jurel','R Sai Kishore','S Gopal','Kartik Tyagi',
       'P Dubey','Harpreet Brar','Yash Thakur','SN Khan','R Powell','J Yadav','MJ Henry','Ashwani Kumar',
       'Musheer Khan','Yash Dayal','Zeeshan Ansari'] # 2 player remaining

team_3 = ['Shubman Gill','Ishan Kishan','KK Ahmed','YS Chahal','E Malinga','T Stubbs','N Rana',
                  'SN Thakur','M Prasidh Krishna','DL Chahar','P Simran Singh','Naman Dhir','DS Rathi',
                  'Prince Yadav','D Padikkal','J Overton','Umran Malik','Akash Singh'] # 7 Players remaining

team_4 = ['SA Yadav','Tilak Varma','AR Patel','Arshdeep Singh','Harshit Rana','Kuldeep Yadav',
                'HV Patel','C Bosch','GD Phillips','TL Seifert','A Raghuvanshi','Ashutosh Sharma',
                'Swapnil Singh','XC Bartlett',] # 6 player remaining

team_5 = ['V Kohli','SP Narine','JC Archer','D Brevis','KH Pandya','MA Starc','K Rabada',
               'Avesh Khan','M Shahrukh Khan','MS Dhoni','KK Nair','RA Tripathi','Shahbaz Ahmed',
               'D Ferreira','SM Curran','I Sharma','Mustafizur Rahman','Akash Deep','Rasikh Salam'] # 4 players reamining

team_6 = ['C Green','R Shepherd','M Jansen','Q de Kock','JM Sharma','M Pathirana','AK Markram',
               'VR Iyer','RD Chahar','AS Roy','Urvil Patel','Anuj Rawat','M Siddharth','Suyash Sharma',
               'Sandeep Sharma','DA Miller','LS Livingstone','A Kamboj'] # 3 players reamaining

team_7 = ['HH Pandya','S Dube','RA Jadeja','RR Pant','Mohammed Siraj','RK Singh','RM Patidar','TH David',
           'Nithish Kumar Reddy','Ramandeep Singh','MP Breetzke','T Natarajan','TU Deshpande','N Wadhera',
           'Sameer Rizvi','A Badoni','AA Kulkarni','MJ Suthar','Abishek Porel','A Nortje',
           'KT Maphaka','Shivam Mavi'] # 1 player remaining

team_8 = ['RD Gaikwad','JC Buttler','SV Samson','JJ Bumrah','CV Varun','Washington Sundar','R Parag',
             'JO Holder','N Burger','PVD Chameera','JD Unadkat','Suryansh Shedge',
             'JG Bethell','MK Pandey'] # 8 players remaining

team_9 = ['MR Marsh','N Pooran','B Kumar','Noor Ahmad','PJ Cummins','JP Inglis','FA Allen',
                      'LH Ferguson','Priyansh Arya','Aniket Verma','Harsh Dubey','Kumar Kushagra',
                      'VG Arora','V Puthur','R Tewatia','WG Jacks','KR Sen','Yudhvir Singh'] #6 players remaining

team_10 = ['YBK Jaiswal','RG Sharma','TM Head','Abhishek Sharma','NT Ellis','SO Hetmyer','MP Stoinis',
       'MJ Santner','Abdul Samad','Arjun Tendulkar','R Minz','Vishnu Vinod','Mukesh Choudhary',
       'Arshad Khan','Mohsin Khan','M Markande','Vijaykumar Vyshak','MJ Owen','MW Short','R Ravindra',
       'SB Dubey','PH Solanki'] # 3 Playersr reamining

In [21]:
all_teams = {'team_1':team_1,
             'team_2':team_2,
             'team_3':team_3,
             'team_4':team_4,
             'team_5':team_5,
             'team_6':team_6,
             'team_7':team_7,
             'team_8':team_8,
             'team_9':team_9,
             'team_10':team_10
}

### Match info for match held between

In [22]:
match_info = df.groupby(['match_id']).agg({'batting_team':'first','bowling_team':'first'}).reset_index()

match_info.rename(columns={'batting_team':'team_1','bowling_team':'team_2'}, inplace=True)

### Apply captain and Vice-Captain Boost

In [23]:
boost_df = pd.DataFrame({'player':['PD Salt','SS Iyer','Shubman Gill','SA Yadav','V Kohli','C Green','HH Pandya','RD Gaikwad','MR Marsh','YBK Jaiswal',
                                       'RG Sharma','N Pooran','JC Buttler','S Dube', 'R Shepherd','SP Narine','Tilak Varma','Ishan Kishan','Rashid Khan','KL Rahul',],
                             'BOOST':[2,2,2,2,2
                                      ,2,2,2,2,2,
                                      1.5,1.5,1.5,1.5,1.5,
                                      1.5,1.5,1.5,1.5,1.5]})

### Feature Engineering

#### Dot,1s ,2s, 3s, 4s, 6s

In [24]:
df['isdot'] = ( (df['runs_off_bat']==0) & (df['wides'].isna()) & (df['noballs'].isna()) ).astype(int)
df['is_batter_dot'] = ((df['runs_off_bat']==0) & (df['wides'].isna()) ).astype(int)
df['isone'] = df['runs_off_bat'].apply(lambda x: 1 if x == 1 else 0)
df['istwo'] = df['runs_off_bat'].apply(lambda x: 1 if x == 2 else 0)
df['isthree'] = df['runs_off_bat'].apply(lambda x: 1 if x == 3 else 0)
df['isfour'] = df['runs_off_bat'].apply(lambda x: 1 if x == 4 else 0)
df['issix'] = df['runs_off_bat'].apply(lambda x: 1 if x == 6 else 0)

#### Bowler Runs, Over No

In [25]:
df['is_bowler_runs'] = df['runs_off_bat'].fillna(0) + df['wides'].fillna(0) +df['noballs'].fillna(0) 
df['over_no'] = df['ball'].apply(np.ceil)

#### Is Ball?

In [26]:
df['is_ball'] = (df['wides'].isna() & df['noballs'].isna()).astype(int)
df['is_batter_ball'] = (1 & df['wides'].isna()).astype(int)

#### Is bowler Wicket

In [27]:
df['is_bowl_out'] = np.where(df['wicket_type'].isin(['caught', 'bowled',  'lbw', 'caught and bowled',
    'stumped', 'hit wicket']),1,0)

### Batting Points

#### Groupby Batting df

In [28]:
batting_df = df.groupby(['match_id','striker']).agg({'runs_off_bat':'sum','is_batter_ball':'sum','is_batter_dot':'sum','isfour':'sum','issix':'sum'}).reset_index()

####  Bat SR, bat points, boundary points, run Bonus

In [29]:
batting_df['sr'] = round(batting_df['runs_off_bat']/batting_df['is_batter_ball'] * 100,2)
batting_df['batting_points'] = batting_df['runs_off_bat']
batting_df['batting_boundary_points'] = batting_df['isfour']*4 + batting_df['issix']*6
batting_df['batting_run_bonus'] = batting_df['runs_off_bat'].apply(lambda x: 16 if x>=100 else(
                                                                                12 if x>=75 else(
                                                                                    8 if x>=50 else(
                                                                                        4 if x>=25 else
                                                                                            -2 if x==0 else 0))   
                                                                ))
batting_df['batting_sr_points'] = batting_df.apply(lambda x : 0 if x['is_batter_ball']<=10 else
                                                6 if x['sr'] > 170 else 
                                                4 if x['sr'] > 150 else
                                                2 if x['sr'] > 130 else
                                                -6 if x['sr'] < 50 else
                                                -4 if x['sr'] < 60 else
                                                -2 if x['sr'] < 70 else 0, axis=1)
batting_df.rename(columns={'striker':'player'}, inplace=True)
batting_df['total_batting_points'] = batting_df['batting_points'] + batting_df['batting_boundary_points'] + batting_df['batting_run_bonus'] + batting_df['batting_sr_points']

In [42]:
batting_df.head()

   match_id         player  runs_off_bat  is_batter_ball  is_batter_dot  isfour  issix      sr  batting_points  batting_boundary_points  batting_run_bonus  batting_sr_points  total_batting_points
0   1473438  A Raghuvanshi            30              22              4       2      1  136.36              30                       14                  4                  2                    50
1   1473438     AD Russell             4               3              2       1      0  133.33               4                        4                  0                  0                     8
2   1473438      AM Rahane            56              31             14       6      4  180.65              56                       48                  8                  6                   118
3   1473438     D Padikkal            10              10              3       1      0  100.00              10                        4                  0                  0                    14
4   1473438   Harshit Rana             5               6              4       1      0   83.33               5                        4                  0                  0                     9

### Bowler Points

#### Groupby Bowler df for Maiden

In [30]:
bowling_df = df.groupby(['match_id','bowler','over_no']).agg({'is_bowler_runs':'sum','is_ball':'sum','is_bowl_out':'sum','isdot':'sum'}).reset_index()

#### Is maiden

In [31]:
bowling_df['is_maiden'] = bowling_df.apply(lambda x: 1 if ((x['is_bowler_runs']==0) & (x['isdot']==6)) else 0, axis=1)

In [43]:
bowling_df.head()

   match_id          player  is_bowler_runs  is_ball  is_bowl_out  isdot  is_maiden  economy  bowling_wkt_points  bowling_dot_points  bowling_economy_points  bowling_wkt_bonus  bowling_maiden_points  total_bowling_points
0   1473438        CV Varun            43.0       24            1      7          0    10.75                  30                   7                      -6                  0                      0                    31
1   1473438    Harshit Rana            32.0       18            0      4          0    10.67                   0                   4                      -6                  0                      0                    -2
2   1473438    JR Hazlewood            22.0       24            2     16          0     5.50                  60                  16                       4                  0                      0                    80
3   1473438       KH Pandya            29.0       24            3      8          0     7.25                  90                   8                       0                  4                      0                   102
4   1473438  LS Livingstone            14.0       12            0      2          0     7.00                   0                   2                       0                  0                      0                     2

#### Groupby Bowler df

In [32]:
bowling_df = bowling_df.groupby(['match_id','bowler']).agg({'is_bowler_runs':'sum','is_ball':'sum','is_bowl_out':'sum','isdot':'sum','is_maiden':'sum'}).reset_index()

#### Economy, Wkt points, dot points, economy points

In [33]:
bowling_df['economy'] = round(bowling_df['is_bowler_runs']/bowling_df['is_ball'] *6, 2)
bowling_df['bowling_wkt_points'] = bowling_df['is_bowl_out'] * 30
bowling_df['bowling_dot_points'] = bowling_df['isdot']
bowling_df['bowling_economy_points'] = bowling_df.apply(lambda x: 0 if x['is_ball']<12 else
                                                        6 if x['economy'] < 5 else
                                                        4 if x['economy'] < 6 else
                                                        2 if x['economy'] < 7 else
                                                        -2 if x['economy'] > 12 else
                                                        -4 if x['economy'] > 11 else
                                                        -6 if x['economy'] > 10 else 0, axis=1)
bowling_df['bowling_wkt_bonus'] = bowling_df['is_bowl_out'].apply(lambda x: 12 if x >= 5 else
                                                                8 if x >= 4 else
                                                                4 if x >= 3 else 0)
bowling_df['bowling_maiden_points'] = bowling_df['is_maiden'] * 12

bowling_df.rename(columns={'bowler':'player'}, inplace=True)

bowling_df['total_bowling_points'] = bowling_df['bowling_wkt_points'] + bowling_df['bowling_economy_points'] + bowling_df['bowling_dot_points'] + bowling_df['bowling_wkt_bonus'] +bowling_df['bowling_maiden_points']

In [44]:
bowling_df.head()

   match_id          player  is_bowler_runs  is_ball  is_bowl_out  isdot  is_maiden  economy  bowling_wkt_points  bowling_dot_points  bowling_economy_points  bowling_wkt_bonus  bowling_maiden_points  total_bowling_points
0   1473438        CV Varun            43.0       24            1      7          0    10.75                  30                   7                      -6                  0                      0                    31
1   1473438    Harshit Rana            32.0       18            0      4          0    10.67                   0                   4                      -6                  0                      0                    -2
2   1473438    JR Hazlewood            22.0       24            2     16          0     5.50                  60                  16                       4                  0                      0                    80
3   1473438       KH Pandya            29.0       24            3      8          0     7.25                  90                   8                       0                  4                      0                   102
4   1473438  LS Livingstone            14.0       12            0      2          0     7.00                   0                   2                       0                  0                      0                     2

#### Merging Bat_df , bowl_df , boost_df

In [34]:
total_points_df = pd.merge(batting_df,bowling_df, on=['match_id','player'], how='outer')
total_points_df = total_points_df.merge(match_info, on=['match_id'],how='outer')

#### Add Total_points clmn

In [35]:
total_points_df['total_batting_points'].fillna(0, inplace=True)
total_points_df['total_bowling_points'].fillna(0, inplace=True)

total_points_df['total_points'] = total_points_df['total_batting_points'] + total_points_df['total_bowling_points']

In [47]:
total_points_df[['match_id','player','total_batting_points','total_bowling_points','total_points']].head()

   match_id         player  total_batting_points  total_bowling_points  total_points
0   1473438  A Raghuvanshi                  50.0                   0.0          50.0
1   1473438     AD Russell                   8.0                   0.0           8.0
2   1473438      AM Rahane                 118.0                   0.0         118.0
3   1473438       CV Varun                   0.0                  31.0          31.0
4   1473438     D Padikkal                  14.0                   0.0          14.0

In [48]:
total_points_df[['match_id','player','total_batting_points','total_bowling_points','total_points']].tail()

      match_id           player  total_batting_points  total_bowling_points  total_points
1660   1485779     Sameer Rizvi                 114.0                   0.0         114.0
1661   1485779  Sediqullah Atal                  36.0                   0.0          36.0
1662   1485779   Shashank Singh                  11.0                   0.0          11.0
1663   1485779         T Stubbs                  26.0                   0.0          26.0
1664   1485779          V Nigam                   0.0                  65.0          65.0

#### Final df Total points for Players

In [36]:
final_df = total_points_df.groupby(['player'])['total_points'].sum().reset_index().sort_values(by='total_points',ascending=False)
final_df.rename(columns={'total_points':'points'},inplace=True)

In [45]:
final_df.head()

      player  points  BOOST  total_points
0   A Badoni   644.0    1.0         644.0
1   A Kamboj   328.0    1.0         328.0
2  A Manohar    95.0    1.0          95.0
3   A Mhatre   484.0    1.0         484.0
4   A Nortje    45.0    1.0          45.0

#### Adding Captaincy boost for player

In [37]:
final_df = final_df.merge(boost_df, on='player',how='outer')
final_df['BOOST'] = final_df['BOOST'].fillna(1)
final_df['total_points'] = final_df['points'] * final_df['BOOST']

#### Adding Team and Team Points in Dictionary

In [38]:
final_team_points_dict = {}

for team_name, players in all_teams.items():
    final_team_points_dict[f'{team_name}'] = final_df[final_df['player'].isin(players)]['total_points'].sum()

final_team_names = list(final_team_points_dict.keys()) # Storing Team names in a list
final_team_points = list(final_team_points_dict.values()) # Storing Team Points In a List

#### ranking the points

In [39]:
rank_df = pd.DataFrame({'teams': final_team_names[:10],
                    'points': final_team_points[:10]})

rank_df['rank'] = rank_df['points'].rank(ascending=False)

#### Final Points Table for Auction

In [40]:
rank_df = rank_df.sort_values(by='rank')
rank_df

     teams   points  rank
2   team_3  10605.0   1.0
1   team_2  10437.0   2.0
8   team_9  10349.0   3.0
6   team_7   8967.0   4.0
4   team_5   8491.5   5.0
3   team_4   8064.5   6.0
9  team_10   7461.0   7.0
0   team_1   7425.0   8.0
7   team_8   5819.0   9.0
5   team_6   5402.5  10.0

Download DF

In [41]:
total_points_df_download =0
rank_df_download = 0

if total_points_df_download == 1:
    total_points_df.to_csv('Player Points 2025 Match by Match.csv', index=False)
if rank_df_download == 1:
    rank_df.to_csv('Rank_df.csv', index=False)